% Функція для симуляції битви при Каннах
function simulate_battle_of_cannae()
    B0 = 50000;   % Початковий розмір римської армії
    R0 = 86000;   % Початковий розмір армії Карфагена

    % Втрати в битві становили 6000 для армії Карфагена і 50000 для римської армії
    B_end = B0 - 6000;   % Кінцевий розмір армії Карфагена після втрат
    R_end = R0 - 50000;  % Кінцевий розмір римської армії після втрат

    % Коригування параметрів beta та rho
    beta = 0.095;  
    rho = 0.012;   

    tspan = [0 9];  % Тривалість битви - 9 годин

    y0 = [B0; R0];
    % Використання функції unaimed_fire5 для симуляції битви
    [t, y] = ode45(@(t, y) unaimed_fire5(t, y, beta, rho), tspan, y0);

    
    % Графік результатів
    figure;
    plot(t, y(:, 1), 'b', t, y(:, 2), 'r','LineWidth',2)

xlabel('Час');
ylabel('Чисельність війська');
legend('Армія Карфагена', 'Римська армія');
title('Симуляція битви при Каннах');
end
