import React from 'react'

import Carousel from './Carousel'

export const About = () =>{
    return (
 
      <div>
       
        <div style={{alignItems:'center', justifyContent:'center', width:'100%', display:'flex', marginBottom:'15px', fontSize:'23px', fontWeight:'600'}}>Про нас</div>
        <div className='about'>
        <Carousel /> <br />
        <strong>FlowersLand</strong>- це прекрасний магазин квітів, де можна знайти різноманітні сорти квітів і рослин для будь-якої нагоди. 
        З великим асортиментом квітів та професійним підходом до обслуговування клієнтів, <strong>FlowersLand</strong> став популярним місцем для покупки квітів.<br></br><br></br>

        Магазин пропонує широкий вибір квітів, від кращих сортів троянд до екзотичних орхідей. Кожен букет складається з кращих квітів 
        і підібирається так, щоб він відповідав особистому смаку та потребам клієнта. 
        У магазині також пропонують широкий асортимент квітів для весіль, ювілеїв, днів народження та інших святкових подій.<br></br><br></br>

        Працівники <strong>FlowersLand</strong> - це справжні фахівці у своїй справі, вони завжди готові допомогти клієнтам з вибором квітів та скласти для них найкрасивіші букети. 
        Вони завжди поставляють свіжі квіти, що допомагає зберегти їх прекрасний вигляд на тривалий час.<br></br><br></br>

        <strong>FlowersLand</strong> - це не просто магазин квітів, а місце, де клієнти можуть отримати незабутні враження та позитивні емоції. 
        Від чудового асортименту квітів до привітного персоналу та високого рівня обслуговування, тут ви знайдете все, що потрібно для створення прекрасної атмосфери.<br></br><br></br>
        Отже, якщо ви шукаєте найкращий магазин квітів, де можна придбати якісні та свіжі квіти, а також отримати відмінне обслуговування, 
        <strong>FlowersLand</strong> - це те місце, на яке варто звернути увагу. Тут ви знайдете все, що потрібно для створення незабутніх моментів та приємних емоцій.<br></br>

        </div>
      </div>
    )
  }

